In [49]:
import pandas as pd
import numpy as np

# Read Write .csv

### Read

In [50]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Write

In [51]:
# We need a dataframe to write it in csv/excel/or any file.

In [52]:
df = pd.DataFrame(np.arange(20,36).reshape(4,4), columns=['A', 'B', 'C', 'D'])

In [53]:
df

    A   B   C   D
0  20  21  22  23
1  24  25  26  27
2  28  29  30  31
3  32  33  34  35

In [54]:
df.to_csv('csv_output.csv', index=False)

In [56]:
# Cross Check
pd.read_csv('csv_output.csv')

    A   B   C   D
0  20  21  22  23
1  24  25  26  27
2  28  29  30  31
3  32  33  34  35

# Read Write .xlsx

### Read

In [61]:
pd.read_excel("Excel_Sample.xlsx")

    A   B   C   D
0  20  21  22  23
1  24  25  26  27
2  28  29  30  31
3  32  33  34  35

### Write

In [58]:
df = pd.DataFrame(np.random.randn(4,5), columns=['A', 'B', 'C', 'D', 'E'])

In [59]:
df

          A         B         C         D         E
0 -0.673922  0.341082  2.088422 -1.362619 -1.135715
1 -0.676407 -0.249440 -0.425007 -0.156865 -0.825708
2  0.445339 -0.259901  0.403806 -0.159246  0.700697
3  0.762447  1.200664  0.103094  0.664217 -1.454573

In [60]:
df.to_excel('Ex_output.xlsx', index=False)

In [62]:
# CROSS Check
pd.read_excel('Ex_output.xlsx')

          A         B         C         D         E
0 -0.673922  0.341082  2.088422 -1.362619 -1.135715
1 -0.676407 -0.249440 -0.425007 -0.156865 -0.825708
2  0.445339 -0.259901  0.403806 -0.159246  0.700697
3  0.762447  1.200664  0.103094  0.664217 -1.454573

# Read and Save HTML

In [64]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [66]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

### We can read data from HTML and save it in a DataFrame. We can perform operations on this data frame but we cannot write back in HTML page.